title: Anomaly detection for wildfly
id: 082c6be1-cb74-4957-90e3-7fcf398dd6ff
status: experimental
description: Detecting suspicious log events which lead to potential security threats
author: Loginsoft Research Unit
references:
    - Internal Research
date: 2020/08/12
logsource:
  product: wildfly
  category: webserver
detection:
    keywords:
      - 'Error unmarshaling'
      - 'Error marshaling'
    condition: keywords
falsepositives:
  - Unknown
level: critical