title: Anomaly detection for wildfly
status: experimental
description: Detecting suspicious log events which lead to potential security threats
author: Loginsoft Research Unit
references:
    - Internal Research
date: 2020/07/24
logsource:
  product: wildfly
  category: webserver
detection:
    keywords:
      - "attempt to add a Permission to a readonly PermissionCollection"
      - "Shutting down process controller"
      - "Cannot resolve com.mysq.jdbc.ReplicationConnection.ping method. Will use 'SELECT 1' instead."
      - "persistence unit name (*) contains illegal '/' character"
      - "Setting security roles: *"
      - "Invalid User"
      - "Unable to find closing quote for *"
      - "Failed to create instance."
      - "duplicate pk sql: *"
      - "plugin * requires root permissions to execute, skipping"
      - "Failed to init SSLContext"
      - "Failed to get SSLContext for TLS algorithm"
      - "Missing mandatory part of JASPI configuration in the security domain."
      - "Failed to verify password in JAAS callbackhandler *"
      - "Authorization failed"
      - "only string password accepted"
    condition: keywords
falsepositives:
  - Unknown
level: High