{"actions":[],"created_at":"2020-08-04T09:34:26.889Z","updated_at":"2020-08-04T09:34:26.906Z","created_by":"elastic","description":"Detecting suspicious error log events which lead to potential security threats","enabled":false,"false_positives":[],"filters":[],"from":"now-360s","id":"7d2b1c75-f79f-4448-92b7-40b983d23ea4","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"e0106d5d-7de7-4f40-a40b-d2d2429358f8","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Anomaly Nginx_High","query":"event.dataset: \"nginx.error\" and message: \"http invalid header:\" or message: \"client sent invalid header:\" or message: \"zero size buf\" or message: \"zero size buf in writer\" or message: \"rt signal queue overflow recovered\" or message: \"auth http server sent invalid response\" or message: \"memcached sent invalid trailer\" or message: \"http charset invalid utf\"  or message: \"client sent too large request\" or message: \"upstream sent invalid header\" or message: \"client intended to send body data larger than declared\" or message: \"receive buffer overrun\" or message: \"request reference counter overflow while processing\" or message: \"http2 preread buffer overflow\" or message: \"upstream sent too large http2 header name length\" or message: \"upstream sent too large http2 header value length\" or message: \"header is too large\"  or message: \"client sent invalid host in request line\" or message: \"no OCSP responder URL in certificate\" or message:\"empty host in OCSP responder in certificate\"","references":[],"meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/siem"},"severity":"high","updated_by":"elastic","tags":["nginx"],"to":"now","type":"query","threat":[],"throttle":"no_actions","version":1}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}
