{"actions":[],"created_at":"2020-08-03T10:51:15.690Z","updated_at":"2020-08-03T11:22:52.759Z","created_by":"elastic","description":" Detecting suspicious error log events which lead to potential security threats","enabled":false,"false_positives":[],"filters":[],"from":"now-360s","id":"2a8fa729-9875-4ac1-8d58-b3dcc8ebfebe","immutable":false,"index":["cyberjava*"],"interval":"5m","rule_id":"2cb91012-a682-42e4-ab96-e1692c25ea05","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":72,"name":"Anomaly detection for Tomcat - Critical","query":"path: \"/home/cyber/research/tomcat/28_caused_by.log\" and message: \"Failed authenticate() test\" or message : \"Security Violation, attempt to use Restricted Class:\" or message : \"Calling hasUserDataPermission()\" or message : \"Checking for all roles mode:\" or message : \"Invalid escape character in cookie value\" or message : \"Calling hasUserDataPermission()\" or message : \"Sendfile configured to send more data than was available\"","references":[],"meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/siem"},"severity":"high","updated_by":"elastic","tags":["tomcat"],"to":"now","type":"query","threat":[],"throttle":"no_actions","version":2}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}
