{"actions":[],"created_at":"2020-08-03T08:52:40.205Z","updated_at":"2020-08-03T08:52:40.216Z","created_by":"elastic","description":"Detecting suspicious error log events which lead to potential security threats","enabled":false,"false_positives":[],"filters":[],"from":"now-360s","id":"a4bc20bf-4053-4022-a7b0-5871adfe77eb","immutable":false,"index":["cyberjava* "],"interval":"5m","rule_id":"229614e1-19ae-43f6-97c2-673abd66c171","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":54,"name":"Anomaly Detection For Tomcat ","query":"path: \"/home/cyber/research/tomcat/28_caused_by.log\" and message : \"Invalid method resource injection annotation\" or message : \"Calling hasUserDataPermission()\" or message : \"Skipping CSRF nonce-check for GET request to entry point\" or message : \"CORS Preflight request bypassing authentication\" or message : \"Calling hasUserDataPermission()\" or message : \"No umask setting was found in system property [*]. However, it appears Tomcat is running on a platform that supports umask. The system property is typically set in CATALINA_HOME/bin/catalina.sh. The Lifecycle listener org.apache.catalina.security.SecurityListener (usually configured in CATALINA_BASE/conf/server.xml) expects a umask at least as restrictive as \"","references":[],"meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/siem"},"severity":"medium","updated_by":"elastic","tags":["tomcat"],"to":"now","type":"query","threat":[],"throttle":"no_actions","version":1}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}
