{"actions":[],"created_at":"2020-08-13T05:23:43.295Z","updated_at":"2020-08-13T06:31:31.191Z","created_by":"elastic","description":"Detecting suspicious log events which lead to potential security threats","enabled":false,"false_positives":[],"filters":[],"from":"now-360s","id":"76d75aa6-648e-4f66-916f-971070afd848","immutable":false,"index":["logstash-wildify*"],"interval":"5m","rule_id":"aad6744d-46df-4e91-ae32-8eaf7b11a24c","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":79,"name":"Wildify Anomaly_Critical","query":"path: \"/home/cyber/research/wildify/Anomaly_Wildfly_test_logs.txt\" and message : \"Error unmarshaling\" or message : \"Error marshaling\"","references":[],"meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/siem"},"severity":"high","updated_by":"elastic","tags":["wildify"],"to":"now","type":"query","threat":[],"throttle":"no_actions","version":2}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}
