{"actions":[],"created_at":"2020-08-13T06:18:45.222Z","updated_at":"2020-08-13T06:31:31.210Z","created_by":"elastic","description":"Detecting suspicious log events which lead to potential security threats","enabled":false,"false_positives":[],"filters":[],"from":"now-360s","id":"df8e4bfc-3396-4917-b8b3-aa50d393ec16","immutable":false,"index":["logstash-wildify*"],"interval":"5m","rule_id":"3c54cf7f-f72d-4b70-9efb-3c396966162b","language":"kuery","output_index":".siem-signals-default","max_signals":100,"risk_score":54,"name":"Wildify Anomaly_High","query":"message: \"SSL support has been enabled but no security domain or client/server SSL contexts have been specified\" or message : \"Could not create redirect URI\" or message : \"A valid JNDI name must be provided:\" or message : \"Rejecting call because it is not part of any XTS transaction\" or message : \"Failed to parse\" or message : \"Failed to construct component instance\" or message : \"attempt to add a Permission to a readonly PermissionCollection\" or message : \"Shutting down process controller\" or message : \"Cannot resolve com.mysq.jdbc.ReplicationConnection.ping method. Will use 'SELECT 1' instead.\" or message : \"Invalid User\" or message : \"Failed to create instance.\" or message : \"Failed to init SSLContext\" or message : \"Failed to get SSLContext for TLS algorithm\"  or message: \"Missing mandatory part of JASPI configuration in the security domain.\"  or message:  \"Failed to verify password in JAAS callbackhandler\" or message:  \"Authorization failed\" or message: \"only string password accepted\"","references":[],"meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/siem"},"severity":"high","updated_by":"elastic","tags":["wildify"],"to":"now","type":"query","threat":[],"throttle":"no_actions","version":2}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}
